# Basics(Creation) of DataFrame

In [1]:
#Exp no:3

In [2]:
#Aim:Basics(creation) of DataFrame

In [3]:
#Name:Tanvi Gajanan Kacharde
#Roll no:25
#Sec:A
#Subject:ET1
#Date:25-08-2025

In [4]:
#importing the basic library
import pandas as pd

In [5]:
#Creating Data Frame
df=pd.DataFrame([[21,20,25,27],[18,19,20,17],[15,16,14,13],[11,12,13,14]],
columns=["CD","DBMS","DSS","CAO"])

In [6]:
df

   CD  DBMS  DSS  CAO
0  21    20   25   27
1  18    19   20   17
2  15    16   14   13
3  11    12   13   14

In [7]:
df.shape

(4, 4)

In [8]:
df.ndim

2

In [9]:
df.size

16

In [10]:
# Adding record (row) to data frame

In [11]:
df2=pd.DataFrame([[20,25,17,14]],
columns=["CD","DBMS","DSS","CAO"])

In [12]:
df2

   CD  DBMS  DSS  CAO
0  20    25   17   14

In [13]:
df3=df.append(df2,ignore_index=True)

# Adding Attribute

In [18]:
df3["DM"]=[12,15,16,14,17]

In [19]:
df3

   CD  DBMS  DSS  CAO  DM
0  21    20   25   27  12
1  18    19   20   17  15
2  15    16   14   13  16
3  11    12   13   14  14
0  20    25   17   14  17

# Deleting Record From DataFrameÂ¶

In [20]:
df4=df3.drop(index=[1])

In [21]:
df4

   CD  DBMS  DSS  CAO  DM
0  21    20   25   27  12
2  15    16   14   13  16
3  11    12   13   14  14
0  20    25   17   14  17

In [22]:
df5=df3.drop(columns=["DM"])

In [23]:
#Finding mean of DSS
print("Mean of DSS:",df5["DSS"].mean())

Mean of DSS: 17.8

In [24]:
#Finding max of DSS
print("Max of DSS:",df5["DSS"].max())

Max of DSS: 25

In [25]:
#Finding min of DSS
print("Min of DSS:",df5["DSS"].min())

Min of DSS: 13

In [26]:
Name=["Tanvi","Atharv","Spruha","Swarali","Rudransh"]
Name

['Tanvi', 'Atharv', 'Spruha', 'Swarali', 'Rudransh']

In [27]:
#Creating a series
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1       Tanvi
2      Atharv
3      Spruha
4     Swarali
5    Rudransh
dtype: object